# coding: utf-8

WHITESPACE_RULES = [" ", "\t", "\r", "\n"]

NUMBERS_RULES = {
    "О": "0",
    "O": "0",
    "З": "3",
    "I": "1",
    "I": "1",
    "L": "1",
    "S": "5",
    "b": "6",
    "B": "8",
}

LATIN_RULES = {
    "У": "Y",
    "К": "K",
    "Е": "E",
    "Н": "H",
    "Х": "X",
    "В": "B",
    "А": "A",
    "Р": "P",
    "О": "O",
    "С": "C",
    "М": "M",
    "Т": "T"
}

KYRILLIC_RULES = {
    "Y": "У",
    "K": "К",
    "E": "Е",
    "H": "Н",
    "X": "Х",
    "B": "В",
    "A": "А",
    "P": "Р",
    "O": "О",
    "C": "С",
    "M": "М",
    "T": "Т"
}
